10/data/attachments/1f276cddc5e462bd.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Richard_especially_Actions_55124_2</nif:username>
            <nif:friendToBeRequested>soap_actions_d7692a9d-d0ce-457b-9faf-562185c50258</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>